Комплексная_автоматизация_2_МОМ_2019/src/InformationRegisters/ТаможенныеДекларацииЭкспортКРегистрации/ТаможенныеДекларацииЭкспортКРегистрации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТаможенныеДекларацииЭкспортКРегистрации</name>
  <resources>
    <name>СуммаДокумента</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>ДатаРеализации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <dimensions>
    <name>РеализацияЭкспорт</name>
    <type>
      <types>DefinedType.ОснованиеСчетФактураВыданный</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Комплексная_автоматизация_2_МОМ_2019/src/Enums/ТипыНалогообложенияНДС/ТипыНалогообложенияНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыНалогообложенияНДС</name>
  <enumValues>
    <name>НалоговыйАгентПоНДС</name>
  </enumValues>
  <enumValues>
    <name>ПоФактическомуИспользованию</name>
  </enumValues>
  <enumValues>
    <name>ПродажаНаЭкспорт</name>
  </enumValues>
  <enumValues>
    <name>ПродажаНеОблагаетсяНДС</name>
  </enumValues>
  <enumValues>
    <name>ПродажаОблагаетсяЕНВД</name>
  </enumValues>
  <enumValues>
    <name>ПродажаОблагаетсяНДС</name>
  </enumValues>
  <enumValues>
    <name>ЭкспортСырьевыхТоваровУслуг</name>
  </enumValues>
  <enumValues>
    <name>ЭкспортНесырьевыхТоваров</name>
  </enumValues>
  <enumValues>
    <name>ВводОСВЭксплуатацию</name>
  </enumValues>
  <enumValues>
    <name>ОпределяетсяРаспределением</name>
  </enumValues>
  <enumValues>
    <name>ОблагаетсяНДСУПокупателя</name>
  </enumValues>
  <enumValues>
    <name>ПроизводствоСДЦ</name>
  </enumValues>
  <enumValues>
    <name>ЭлектронныеУслуги</name>
  </enumValues>
  <enumValues>
    <name>РеализацияРаботУслугНаЭкспорт</name>
  </enumValues>
</mdclass:Enum>

Комплексная_автоматизация_2_МОМ_2019/src/Documents/ТаможеннаяДекларацияЭкспорт/ТаможеннаяДекларацияЭкспорт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ТаможеннаяДекларацияЭкспорт</name>
  <registerRecords>InformationRegister.СведенияТаможенныхДекларацийЭкспорт</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>КодОперации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СборСопроводительныхДокументовЗавершен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DefinedType.ОснованиеСчетФактураВыданный</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДокументыОснования</name>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DefinedType.ОснованиеСчетФактураВыданный</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СопроводительныеДокументы</name>
    <attributes>
      <name>КодТС</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>2</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>2</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТСД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаТСД</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Комплексная_автоматизация_2_МОМ_2019/src/InformationRegisters/ТаможенныеДекларацииЭкспортКРегистрации/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает типы налогообложения НДС по экспорту.
// 
// Параметры:
// Возвращаемое значение:
// 	ТипыПродажаНаЭкспорт - Массив - Типы налогообложения НДС по экспорту.
//
Функция ТипыНалогообложенияНДС() Экспорт
	
	ТипыПродажаНаЭкспорт = Новый Массив();
	ТипыПродажаНаЭкспорт.Добавить(Перечисления.ТипыНалогообложенияНДС.ПродажаНаЭкспорт);
	ТипыПродажаНаЭкспорт.Добавить(Перечисления.ТипыНалогообложенияНДС.ЭкспортНесырьевыхТоваров);
	ТипыПродажаНаЭкспорт.Добавить(Перечисления.ТипыНалогообложенияНДС.ЭкспортСырьевыхТоваровУслуг);
	
	Возврат ТипыПродажаНаЭкспорт;
	
КонецФункции

// Обновляет состояние документа "Реализация товаров и услуг" в регистре
//
// Параметры:
//   РеализацииЭкспорт - Ссылка на документ реализации.
//
Процедура ОбновитьСостояние(Знач РеализацииЭкспорт) Экспорт
	
	Если НЕ ПолучитьФункциональнуюОпцию("ВестиУчетТаможенныхДекларацийНаЭкспорт") Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	РеализацииЭкспорт = ОбщегоНазначенияКлиентСервер.СвернутьМассив(РеализацииЭкспорт);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВложеннаяТаблица.Организация,
	|	ВложеннаяТаблица.РеализацияЭкспорт,
	|	ВложеннаяТаблица.ДатаРеализации,
	|	ВложеннаяТаблица.Контрагент,
	|	ВложеннаяТаблица.Валюта,
	|	СУММА(ВложеннаяТаблица.СуммаДокумента) КАК СуммаДокумента
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДанныеОснованийСчетовФактур.Организация             КАК Организация,
	|		ДанныеОснованийСчетовФактур.Регистратор             КАК РеализацияЭкспорт,
	|		НАЧАЛОПЕРИОДА(ДанныеОснованийСчетовФактур.Дата, ДЕНЬ) КАК ДатаРеализации,
	|		ДанныеОснованийСчетовФактур.Контрагент              КАК Контрагент,
	|		ДанныеОснованийСчетовФактур.Валюта                  КАК Валюта,
	|		ДанныеОснованийСчетовФактур.СуммаБезНДС 
	|		    + ДанныеОснованийСчетовФактур.СуммаНДС          КАК СуммаДокумента
	|	ИЗ
	|		РегистрСведений.ДанныеОснованийСчетовФактур КАК ДанныеОснованийСчетовФактур
	|		
	|	ГДЕ
	|		ДанныеОснованийСчетовФактур.Регистратор В (&РеализацииЭкспорт)
	|		И ДанныеОснованийСчетовФактур.НалогообложениеНДС В (&ПродажаНаЭкспорт)
	|		
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДанныеОснованийСчетовФактур.Организация,
	|		ДанныеОснованийСчетовФактур.Регистратор,
	|		НАЧАЛОПЕРИОДА(ДанныеОснованийСчетовФактур.Дата, ДЕНЬ),
	|		ДанныеОснованийСчетовФактур.Контрагент,
	|		ДанныеОснованийСчетовФактур.Валюта,
	|		- (ДанныеОснованийСчетовФактур.СуммаБезНДС + ДанныеОснованийСчетовФактур.СуммаНДС)
	|	ИЗ
	|		РегистрСведений.ДанныеОснованийСчетовФактур КАК ДанныеОснованийСчетовФактур
	|		
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|			Документ.ТаможеннаяДекларацияЭкспорт.ДокументыОснования КАК ДекларацииЭкспорт
	|		ПО
	|			ДанныеОснованийСчетовФактур.Регистратор = ДекларацииЭкспорт.ДокументОснование
	|				И ДекларацииЭкспорт.Ссылка.Проведен
	|	ГДЕ
	|		ДанныеОснованийСчетовФактур.Регистратор В (&РеализацииЭкспорт)
	|		И ДанныеОснованийСчетовФактур.НалогообложениеНДС В (&ПродажаНаЭкспорт)) ВложеннаяТаблица
	|	
	|СГРУППИРОВАТЬ ПО
	|	ВложеннаяТаблица.Организация,
	|	ВложеннаяТаблица.РеализацияЭкспорт,
	|	ВложеннаяТаблица.ДатаРеализации,
	|	ВложеннаяТаблица.Контрагент,
	|	ВложеннаяТаблица.Валюта
	|
	|ИМЕЮЩИЕ
	|	СУММА(ВложеннаяТаблица.СуммаДокумента) > 0
	|";
	
	Запрос.УстановитьПараметр("РеализацииЭкспорт", РеализацииЭкспорт);
	ТипыПродажаНаЭкспорт = ТипыНалогообложенияНДС();
	Запрос.УстановитьПараметр("ПродажаНаЭкспорт",  ТипыПродажаНаЭкспорт);
	
	ТаможенныеДекларацииКРегистрации = Запрос.Выполнить().Выгрузить();
	ТаможенныеДекларацииКРегистрации.Индексы.Добавить("РеализацияЭкспорт");
	
	Для каждого РеализацияЭкспорт Из РеализацииЭкспорт Цикл
		
		МенеджерЗаписи = РегистрыСведений.ТаможенныеДекларацииЭкспортКРегистрации.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.РеализацияЭкспорт = РеализацияЭкспорт;
		
		Строка = ТаможенныеДекларацииКРегистрации.Найти(РеализацияЭкспорт, "РеализацияЭкспорт");
		
		Если Строка = Неопределено Тогда
			МенеджерЗаписи.Удалить();
		Иначе
			ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Строка);
			МенеджерЗаписи.Записать();
		КонецЕсли;
		
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
